/*===========================================
  ■■■ 실행  흐름의 컨트롤(반복문) ■■■
=============================================*/

// 반복문(while) 실습

// 사용자로부터 임의의 정수를 입력 받아
// 입력 받은 정수가 소수인지 아닌지를 판별하여
// 결과를 출력하는 프로그램을 구현한다.

// ※ 소수 : 1 또는 자기 자신의 값 이외에 어떤 수로도 나누어 떨어지지 않는 수
//			 단, 1은 소수 아님.

// 실행 예)
// 임의의 정수 입력 : 10
// 10 → 소수 아님

// 임의의 정수 입력 : 11
// 11 → 소수

// 임의 정수 입력 : 967

// 그 안의 수가 나눠 떨어지는지 확인하고 만약 나눠 떨어지지 않는다면 1인지 여부 확인해야함
// while 문으로 줄여가야하나?


public class Test053{
	public static void main(String[] args){
		
	}
}