/*===================================
  ■■■ 연산자(Operator) ■■■
======================================*/

// 비트 단위 연산자


public class Test027{
	public static void main(String[] args){
		int x = 128;                       // 00000000 00000000 00000000 10000000

		System.out.printf("x << 3 : %d%n", x<<3);
		// 00000000 00000000 00000100 00000000
		System.out.printf("x * 8  : %d%n", x*8);
		//--==>> x << 3 : 1024  이 연산속도가 더 빠름
		//		 x * 8  : 1024  이게 2의 이동 제곱 만큼 곱해짐


		System.out.printf("x >> 3 : %d%n", x>>3);
		// 00000000 00000000 00000000 00010000
		System.out.printf("x / 8  : %d%n", x/8);
		//--==>> x >> 3 : 16
		//		 x / 8  : 16   이게 2의 이동 제곱 만큼 나눠짐


		System.out.printf("x << 24 : %d%n", x<<24);
		//--==>> x << 24 : -2147483648
		//   10000000 00000000 00000000 00000000

		System.out.printf("x << 24 : %d%n", x<<25);
		System.out.printf("x << 24 : %d%n", x<<31);
		System.out.printf("x << 24 : %d%n", x<<32);
		// x << 24 : 0
		// x << 24 : 0
		// x << 24 : 128    범위 벗어나면 자기 잘이 돌아올때까지 0

	}
	
}