//단일행 주석문


// - 클래스 이름은 'Test001'
// - 자바 프로그램의 클래스 이름은 첫 글자를 대문자로 시작.
// - 자바 프로그램 시작할 때 클래스(class)와 main 함수를
// 기본적으로 입력.
// - 소스코드  저장 시 클래스 이름과 동일한 팡리 이름으로 저장.
// 단. 이 때 확장자는 '.java'
public class Test001
{
	// 'main()' 이라는 이름을 가진 함수
	// --  자바 인터프리터가 처음 찾는 함수
	public static void main(String[] args)
	{
		//앞으로 우리가 당분간 코딩해야 하는 영역
		System.out.println("처음 작성한 프로그램");
		System.out.println("내이름은 이윤태");

		// 이름() -> 이 이름을 가진 함수(즉, 메소드) 호출
		// *자바에서의 함수는 독립적으로 존재할 수 없고, 클래스에서 정의되는 형태로 만들어진다.
		
		//'println();'
		//함수, 즉 메소드(기능, 동작, 행위)\
		// 정의 ....호출....

		// 공구창고, 공구함 망치()
		// 구통약통, 먹는 약상자.소화제()
		// 구급 약, 바르는 약상자, 마다카솔()
		// System.our.pinrln();

		//System 도구 상자 안의 'out' 도구 상자 안의
		// 'printnln' 이라는 도구 즉. 메소드
		// ssystem 클래스의 OUT 객체의 PRINTLN()메소드


	}
}